# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  # s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  # m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  # x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# cross attntion 

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  
  - [-1, 1, Conv, [128, 3, 2]]                   
  - [-1, 3, C2f, [128, True]]                    
  - [-1, 1, Conv, [256, 3, 2]]  
  - [-1, 6, C2f, [256, True]]                     
  - [-1, 1, Conv, [512, 3, 2]] 
  - [-1, 6, C2f, [512, True]]                   
  - [-1, 1, Conv, [1024, 3, 2]] 
  - [-1, 3, C2f, [1024, True]]       
  - [-1, 1, SPPF, [1024, 5]] 

restormer_decoder:
  - [8, 1, Reduce_channels, [384, 1, 1]]             
  - [-1, 1, Restormer_transformer, [384, 4, 4]]     
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] 
  - [[-1, 6], 1, Concat, [1]]                    
  - [-1, 1, Reduce_channels, [192, 1, 1]]           
  - [-1, 1, Restormer_transformer, [192, 3, 4]]       
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                      
  - [[-1, 4], 1, Concat, [1]]                       
  - [-1, 1, Reduce_channels, [96, 1, 1]]               
  - [-1, 1, Restormer_transformer, [96, 2, 4]]      
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                     
  - [[-1, 2], 1, Concat, [1]]                          
  - [-1, 1, Reduce_channels, [48, 1, 1]]              
  - [-1, 1, Restormer_transformer, [48, 1, 4]]    
  # - [-1, 1, Restormer_transformer, [48, 1, 4]] 
  - [-1, 1, dct_3d_fa, [48,3,1]]             
  - [-1, 1, Restormer_conv, [3,3,1]]        

head:
  - [9, 1, nn.Upsample, [None, 2, 'nearest']]      
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 3, C2f, [512]]  

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]       
  - [[-1, 4], 1, Concat, [1]]  
  - [-1, 3, C2f, [256]]  
 
  - [24, 1, Conv, [128, 3, 2]]                         
  - [19, 1, Conv, [128, 1, 1]]                       
  - [[-1, 32, 31], 1, Concat, [1]]                       

  - [-1, 1, cross_AttnBlock, [256, 3, 1]]       
  - [-1, 3, C2f, [256]]                          

  - [-1, 1, Conv, [512, 3, 2]]             
  - [[-1, 28], 1, Concat, [1]]  
  - [-1, 1, Conv, [512, 3, 1]]  
  - [15, 1, Conv, [512, 3, 1]]  
  - [[39, -1], 1, Concat, [1]]
  - [-1, 1, cross_AttnBlock, [512, 3, 1]]            

  - [-1, 3, C2f, [512]] 

  - [-1, 1, Conv, [512, 3, 2]]                       
  - [[-1, 9], 1, Concat, [1]] 
  - [-1, 1, Conv, [512, 3, 1]]                      
  - [11, 1, Conv, [512, 3, 1]]                     
  - [[46, -1], 1, Concat, [1]]          
  - [-1, 1, cross_AttnBlock, [512, 3, 1]]

  - [-1, 3, C2f, [512]]

  - [[36, 43, 50], 1, Detect, [nc]]


